app/controllers/posts_controller.rb

  def index
    @posts = Post.all
---
SELECT * FROM `posts`

  def create
    @post = Post.new(params[:post])

    if @post.save
---
INSERT INTO `posts` (`permalink`, `updated_at`, `title`, `body`, `created_at`) VALUES('this-is-just-a-test', '2009-07-22 17:15:58', 'This is just a test', 'Woot?!', '2009-07-22 17:15:58')

  def destroy
    @post = page_post
    @post.destroy
---
DELETE FROM `posts` WHERE `id` = 1