app/controllers/users_controller.rb

INSERT INTO `users` (`permalink`, `updated_at`, `crypted_password`, `username`, `password_salt`, `persistence_token`, `email`, `created_at`) VALUES('conner', '2009-07-22 17:27:39', '70ff04256866565a5bec039953752cc794f734d07e9246f10d923683c0abf89fcf5cb0898d7a0c235fab9d347fb0fd16880e2027358b7a4e223831e316046bde', 'Conner', 'vFWg2W0Bqc6rnpgwysMR', '8a0222e25081d5a87ae90ce0233b683ff6cfdd3e1578ecfb9f46d533a345c392374f2a7ef0827b29428e27ae936bc9e0d70f2b0ff15fc028d93d7913024dce46', 'cpetzold@gmail.com', '2009-07-22 17:27:39')
---
  def create
    @user = User.new(params[:user])
    if @user.save

SELECT * FROM `users` WHERE (`users`.`id` = '2') LIMIT 1
---
  def edit
    @user = User.find(params[:id])