app/controllers/users_controller.rb

DELETE FROM `users` WHERE `id` = 1
---
  def destroy
    @user = current_user
    @user.destroy